Autodesk.Revit.DB.TagByExampleOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TagByExampleOptions.MatchHostRotation
If true, the new tag is rotated to respect the differences in rotation between the example host and target host.
If false, the new tag ignores differences in rotation between the example host and target host.
Since:
2027.2

Autodesk.Revit.DB.TagByExampleOptions.MatchHostFlipMirror
If true, the new tag is flipped and mirrored to respect the differences in flip and mirror between the example host and target host.
If false, the new tag ignores differences in flip and mirror between the example host and target host.
Since:
2027.2

Autodesk.Revit.DB.TagByExampleOptions.MatchTagOrientation
If true, the new tags use the same orientation parameter value as the example tag, even if the example and target hosts are rotated with respect to one another.
If false, the tag head keeps the same orientation relative to the target host.
Since:
2027.2

Autodesk.Revit.DB.TagByExampleOptions.#ctor(System.Boolean,System.Boolean,System.Boolean)
Constructor for TagByExampleOptions.
matchTagOrientation:
The value for MatchTagOrientation.
matchHostFlipMirror:
The value for MatchHostFlipMirror.
matchHostRotation:
The value for MatchHostRotation.
Since:
2027.2

Autodesk.Revit.DB.TagByExampleOptions.#ctor
Constructor for TagByExampleOptions.
Since:
2027.2

Autodesk.Revit.DB.TagByExampleOptions
Options for Tag by Example
Since:
2027.2